Table of Contents
 Enum EdgePositionType
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Position of reinforcement on edge
public enum EdgePositionType
Fields
PartEdgeFromBegin = 1
Part edge from beginning
PartEdgeFromEnd = 2
Part edge from end
PartEdgeToSegment = 3
Part edge to the end
WholeLength = 0
WholeLength
Fields
 Name |  Description
 PartEdgeFromBegin = 1
Part edge from beginning
 PartEdgeFromEnd = 2
Part edge from end
 PartEdgeToSegment = 3
Part edge to the end
 WholeLength = 0
WholeLength
 Edit this page